#기본적인 그리디 문제...지만 1시간 넘게걸림
#오늘의 교훈: 큰 것과 주변이 중요하다.
#5kg과 3kg을 써서 담아야함
#완벽하게 담을수 없으면 -1
n=int(input())
count=0
if n%5==0: print(n//5)
elif n//10==0:
    if n%3==0: print(n//3)
    elif n%5==0: print(n//5)
    elif n==8: print(2)
    else: print(-1)
elif n//10>0: #5와 3의 조화
    #처음부터 3을 계속 빼보는식
    #[5,10,15,20,25,30,35,40,45,50]
    #[8,13,18,23,28,33,38,43,48,53]
    #[11,16,21,26,31,36,41,46,51,56]
    #[14,19,24,29,34,39,44,49,54,59]
    #[17,22,27,32,37,42,47,52,57,62]
    #[20,25,30,35,40,45,50,55,60,65]
    count=0
    while(n>0):
        n-=3
        count+=1
        if n%5==0:
            count+=n//5
            print(count)
            exit(0)
    print(-1)
